Tekla Open API Reference for Tekla Structures 2025
SpiralBeam Constructor (Point, Point, Point, Double, Double, Double, Double)
 Initializes a new instance of the SpiralBeam class with the given parameters.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SpiralBeam(
	Point startPoint,
	Point rotationAxisBasePoint,
	Point rotationAxisUpPoint,
	double totalRise,
	double rotationAngle,
	double twistAngleAtStart,
	double twistAngleAtEnd
)
Public Sub New (
	startPoint As Point,
	rotationAxisBasePoint As Point,
	rotationAxisUpPoint As Point,
	totalRise As Double,
	rotationAngle As Double,
	twistAngleAtStart As Double,
	twistAngleAtEnd As Double
)
Parameters
startPoint
Type: Tekla.Structures.Geometry3d.Point
The spiral beam starting point.
rotationAxisBasePoint
Type: Tekla.Structures.Geometry3d.Point
The first definition point of the spiral beam rotation axis.
rotationAxisUpPoint
Type: Tekla.Structures.Geometry3d.Point
The second definition point of the spiral beam rotation axis.
totalRise
Type: System.Double
The difference between the spiral beam start and end point along the rotation axis direction.
rotationAngle
Type: System.Double
The spiral beam cumulative rotation angle.
twistAngleAtStart
Type: System.Double
The twist angle at the start of the spiral beam.
twistAngleAtEnd
Type: System.Double
The twist angle at the end of the spiral beam.
See Also
Reference
SpiralBeam Class
SpiralBeam Overload
Tekla.Structures.Model Namespace